# ####################################################################

#  Created by Genus(TM) Synthesis Solution 19.11-s087_1 on Tue Jul 05 11:31:16 CEST 2022

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design router

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[66]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[65]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[64]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[63]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[62]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[61]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[60]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[59]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[58]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[57]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[56]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_0[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports ivalid_0]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ivch_0[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[66]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[65]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[64]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[63]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[62]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[61]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[60]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[59]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[58]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[57]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[56]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports ivalid_1]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ivch_1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[66]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[65]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[64]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[63]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[62]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[61]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[60]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[59]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[58]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[57]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[56]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {idata_2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports ivalid_2]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ivch_2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {iack_0[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {iack_0[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ilck_0[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ilck_0[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {iack_1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {iack_1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ilck_1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ilck_1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {iack_2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {iack_2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ilck_2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ilck_2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {my_xpos[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {my_xpos[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {my_xpos[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {my_xpos[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {my_ypos[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {my_ypos[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {my_ypos[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {my_ypos[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports rst_]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {oack_0[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {oack_0[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ordy_0[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ordy_0[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {olck_0[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {olck_0[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {oack_1[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {oack_1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ordy_1[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ordy_1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {olck_1[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {olck_1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {oack_2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {oack_2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ordy_2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ordy_2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {olck_2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {olck_2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[66]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[65]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[64]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[63]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[62]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[61]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[60]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_0[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports ovalid_0]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ovch_0[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[66]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[65]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[64]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[63]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[62]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[61]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[60]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports ovalid_1]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ovch_1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[66]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[65]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[64]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[63]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[62]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[61]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[60]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {odata_2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports ovalid_2]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {ovch_2[0]}]
set_clock_uncertainty -setup 0.02 [get_clocks clk]
set_clock_uncertainty -hold 0.02 [get_clocks clk]
