# ####################################################################

#  Created by Genus(TM) Synthesis Solution 19.11-s087_1 on Wed Oct 26 21:43:46 CEST 2022

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design fir_43bit

set_clock_gating_check -setup 0.0 
set_input_delay -add_delay 0.1 [get_ports clk]
set_input_delay -add_delay 0.1 [get_ports rst]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_0[7]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_0[6]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_0[5]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_0[4]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_0[3]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_0[2]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_0[1]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_0[0]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_1[7]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_1[6]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_1[5]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_1[4]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_1[3]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_1[2]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_1[1]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_1[0]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_2[7]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_2[6]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_2[5]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_2[4]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_2[3]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_2[2]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_2[1]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_2[0]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_3[7]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_3[6]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_3[5]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_3[4]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_3[3]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_3[2]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_3[1]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_3[0]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_4[7]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_4[6]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_4[5]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_4[4]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_4[3]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_4[2]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_4[1]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_4[0]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_5[7]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_5[6]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_5[5]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_5[4]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_5[3]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_5[2]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_5[1]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_5[0]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_6[7]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_6[6]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_6[5]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_6[4]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_6[3]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_6[2]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_6[1]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_6[0]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_7[7]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_7[6]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_7[5]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_7[4]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_7[3]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_7[2]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_7[1]}]
set_input_delay -add_delay 0.1 [get_ports {coeffs_table_7[0]}]
set_input_delay -add_delay 0.1 [get_ports din_vld]
set_input_delay -add_delay 0.1 [get_ports {din_data[42]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[41]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[40]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[39]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[38]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[37]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[36]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[35]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[34]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[33]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[32]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[31]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[30]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[29]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[28]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[27]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[26]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[25]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[24]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[23]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[22]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[21]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[20]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[19]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[18]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[17]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[16]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[15]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[14]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[13]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[12]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[11]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[10]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[9]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[8]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[7]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[6]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[5]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[4]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[3]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[2]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[1]}]
set_input_delay -add_delay 0.1 [get_ports {din_data[0]}]
set_input_delay -add_delay 0.1 [get_ports dout_busy]
set_output_delay -add_delay 0.1 [get_ports din_busy]
set_output_delay -add_delay 0.1 [get_ports dout_vld]
set_output_delay -add_delay 0.1 [get_ports {dout_data[45]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[44]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[43]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[42]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[41]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[40]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[39]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[38]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[37]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[36]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[35]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[34]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[33]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[32]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[31]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[30]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[29]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[28]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[27]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[26]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[25]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[24]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[23]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[22]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[21]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[20]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[19]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[18]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[17]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[16]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[15]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[14]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[13]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[12]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[11]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[10]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[9]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[8]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[7]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[6]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[5]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[4]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[3]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[2]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[1]}]
set_output_delay -add_delay 0.1 [get_ports {dout_data[0]}]
